================================================================================
Regular Ranged Tag
================================================================================
#table
*heading* | /heading/
value | something else
#end
No longer part of the ranged tag.
--------------------------------------------------------------------------------

(document
  (ranged_tag
    (tag_name
      (tag_name_element))
    (ranged_tag_content
      (paragraph_segment
        (bold)
        (italic))
      (paragraph_segment))
    (ranged_tag_end))
  (paragraph
    (paragraph_segment)))

================================================================================
Ranged Verbatim Tag
================================================================================
@math
f(x) = \int
@end
No longer part of the ranged tag.
--------------------------------------------------------------------------------

(document
  (ranged_verbatim_tag
    (tag_name
      (tag_name_element))
    (ranged_verbatim_tag_content)
    (ranged_verbatim_tag_end))
  (paragraph
    (paragraph_segment)))

================================================================================
Ranged Verbatim Tag with Parameters
================================================================================
@code lua
print("Hello world")
@end
No longer part of the ranged tag.
--------------------------------------------------------------------------------

(document
  (ranged_verbatim_tag
    (tag_name
      (tag_name_element))
    (tag_parameters
      (tag_param))
    (ranged_verbatim_tag_content)
    (ranged_verbatim_tag_end))
  (paragraph
    (paragraph_segment)))

================================================================================
@end Tag without Ranged Verbatim Tag
================================================================================
@my.tag
@end

This
@end
shouldn't be a closing tag.
--------------------------------------------------------------------------------

(document
  (ranged_verbatim_tag
    (tag_name
      (tag_name_element)
      (tag_name_element))
    (ranged_verbatim_tag_end))
  (paragraph
    (paragraph_segment)
    (paragraph_segment)
    (paragraph_segment)))

================================================================================
Infecting Tag on paragraph
================================================================================
|comment
This is a comment.

This is no longer part of the comment.
--------------------------------------------------------------------------------

(document
  (paragraph
    (infecting_tag_set
      (infecting_tag
        (tag_name
          (tag_name_element))))
    (paragraph_segment))
  (paragraph
    (paragraph_segment)))

================================================================================
Infecting Tag on generic list
================================================================================
|ordered
- List item 1
- List item 2

This is no longer infected.
--------------------------------------------------------------------------------

(document
  (generic_list
    (infecting_tag_set
      (infecting_tag
        (tag_name
          (tag_name_element))))
    (unordered_list1
      (unordered_list1_prefix)
      (paragraph
        (paragraph_segment)))
    (unordered_list1
      (unordered_list1_prefix)
      (paragraph
        (paragraph_segment))))
  (paragraph
    (paragraph_segment)))

================================================================================
Infecting Tag on quote
================================================================================
|ordered
> quote item 1
> quote item 2

This is no longer infected.
--------------------------------------------------------------------------------

(document
  (quote
    (infecting_tag_set
      (infecting_tag
        (tag_name
          (tag_name_element))))
    (quote1
      (quote1_prefix)
      (paragraph
        (paragraph_segment)))
    (quote1
      (quote1_prefix)
      (paragraph
        (paragraph_segment))))
  (paragraph
    (paragraph_segment)))

================================================================================
Carryover Tag on generic list
================================================================================
- List item 1
+color blue
- List item 2
--------------------------------------------------------------------------------

(document
  (generic_list
    (unordered_list1
      (unordered_list1_prefix)
      (paragraph
        (paragraph_segment)))
    (unordered_list1
      (carryover_tag_set
        (carryover_tag
          (tag_name
            (tag_name_element))
          (tag_parameters
            (tag_param))))
      (unordered_list1_prefix)
      (paragraph
        (paragraph_segment)))))

================================================================================
Carryover Tag on quote
================================================================================
> quote item 1
+color blue
> quote item 2
--------------------------------------------------------------------------------

(document
  (quote
    (quote1
      (quote1_prefix)
      (paragraph
        (paragraph_segment)))
    (quote1
      (carryover_tag_set
        (carryover_tag
          (tag_name
            (tag_name_element))
          (tag_parameters
            (tag_param))))
      (quote1_prefix)
      (paragraph
        (paragraph_segment)))))

================================================================================
Infecting Tag with parameters
================================================================================
|name bob
> Hi, my name is Bob.

Lol
--------------------------------------------------------------------------------

(document
  (quote
    (infecting_tag_set
      (infecting_tag
        (tag_name
          (tag_name_element))
        (tag_parameters
          (tag_param))))
    (quote1
      (quote1_prefix)
      (paragraph
        (paragraph_segment))))
  (paragraph
    (paragraph_segment)))

================================================================================
Disallow Ranged Tag within Ranged Tag
================================================================================
@code java
@MyAnnotation
public class MyClass {}
@end
--------------------------------------------------------------------------------

(document
  (ranged_verbatim_tag
    (tag_name
      (tag_name_element))
    (tag_parameters
      (tag_param))
    (ranged_verbatim_tag_content)
    (ranged_verbatim_tag_end)))

================================================================================
Disallow Carryover Tag within Ranged Tag
================================================================================
@code python
+this is a python comment
print("Hello World")
@end
--------------------------------------------------------------------------------

(document
  (ranged_verbatim_tag
    (tag_name
      (tag_name_element))
    (tag_parameters
      (tag_param))
    (ranged_verbatim_tag_content)
    (ranged_verbatim_tag_end)))
